In [2]:
import pandas as pd
import numpy as np

### 1. Categorizing foods

You are given the following dataframe and are asked to categorize each food into 1 of 3 categories: meat, fruit, or other.  Create a new column to categorize each food item.

In [2]:
foods = pd.DataFrame({'food': ['bacon', 'STRAWBERRIES', 'Bacon', 'STRAWBERRIES', 'BACON',
                               'strawberries', 'Strawberries', 'pecans'],
                      'pounds': [4.0, 3.5, 7.0, 6.0, 3.0, 9.0, 1.0, 3.0]})
foods

           food  pounds
0         bacon     4.0
1  STRAWBERRIES     3.5
2         Bacon     7.0
3  STRAWBERRIES     6.0
4         BACON     3.0
5  strawberries     9.0
6  Strawberries     1.0
7        pecans     3.0

In [3]:
def categorize(x):
    if x.lower() == 'bacon':
        return 'meat'
    elif x.lower() == 'strawberries':
        return 'fruit'
    elif x.lower() == 'pecans':
        return 'other'

In [4]:
foods['category'] = foods['food'].apply(categorize)
foods

           food  pounds category
0         bacon     4.0     meat
1  STRAWBERRIES     3.5    fruit
2         Bacon     7.0     meat
3  STRAWBERRIES     6.0    fruit
4         BACON     3.0     meat
5  strawberries     9.0    fruit
6  Strawberries     1.0    fruit
7        pecans     3.0    other

In this solution, we create a function called `categorize` which has a series of conditional statements for our foods.  We make sure to add `.islower()` to make them all lowercase.  We then just add a new column into the DataFrame and apply the function to the `food` column.

### 2. Cleaning termination dates

Suppose we have a DataFrame with a number of dates in a column from a survey.  Place all of the dates into YYYY format.

In [6]:
survey = pd.DataFrame({'dates': ['08/2012', '2014', '09/2013', '01/2012', '2015']}) 
survey

     dates
0  08/2012
1     2014
2  09/2013
3  01/2012
4     2015

In [9]:
survey['dates'] = np.where(len(survey['dates']) > 4, survey['dates'].str[-4:], 
                           survey['dates'])
survey

  dates
0  2012
1  2014
2  2013
3  2012
4  2015

In this solution, we can morph our column into the desired condition we want by using `np.where()`.  In our `np.where()` statement, the first part is our `if` statement.  If the length of the entry in `dates` is greater than four, we know it is not in YYYY format, so we slice the string at the fourth to last character, which gives us the year.  If the entry is not greater than four characters, we know it is in YYYY format already and we just return the year back in YYYY format.

### 3. Filtering student information

Suppose we have a DataFrame with the information shown below.  to select the rows where the students' favorite color is blue or yellow and their grade is above 90.

In [10]:
students = pd.DataFrame({'age': [20, 19, 22, 21],
                         'favorite_color': ['blue', 'blue', 'yellow', 'green'],
                         'grade': [88, 95, 92, 70],
                         'name': ['John Smith', 'Mary Beth', 'Raymond Parker', 'Al Johnson']})
students

   age favorite_color  grade            name
0   20           blue     88      John Smith
1   19           blue     95       Mary Beth
2   22         yellow     92  Raymond Parker
3   21          green     70      Al Johnson

In [16]:
colors = ['blue', 'yellow']
students.loc[students['favorite_color'].isin(colors) & (students['grade'] > 90)]

   age favorite_color  grade            name
1   19           blue     95       Mary Beth
2   22         yellow     92  Raymond Parker

In this solution, we return the rows that we want by using `students.loc`, then filering for the conditions that we have, which is for color and grade.  It is more convenient for us to create a list of the colors and then use `.isin()` to check whether the colors are in it or not.  This is similar to SQL syntax.

### 4. Drop dates

Given the following dataframe, drop all the rows where the contract_date is between 2018-09-01 and 2018-10-13 (inclusive).

In [17]:
df = pd.DataFrame({'name': ['vendor1', 'vendor2', 'vendor3', 'vendor4', 'vendor5', 'vendor6'],
                   'contract_date': ['2018-09-01', '2018-09-03', '2018-10-11', '2018-08-21',
                                     '2018-08-13', '2018-10-29']})
df

      name contract_date
0  vendor1    2018-09-01
1  vendor2    2018-09-03
2  vendor3    2018-10-11
3  vendor4    2018-08-21
4  vendor5    2018-08-13
5  vendor6    2018-10-29

In [18]:
start_date = '2018-09-01'
end_date = '2018-10-13'
index_list = df.contract_date[(df.contract_date >= start_date) & 
                              (df.contract_date <= end_date)].index.tolist()
df.drop(df.index[index_list], inplace=True)
df.head()

      name contract_date
3  vendor4    2018-08-21
4  vendor5    2018-08-13
5  vendor6    2018-10-29

### 5. Years of experience

Company XYZ is looking to create a report that tracks the tenure of its employees. Using Python, write a snippet to add a column with each individual's years of experience. All records in the table are shown in YYYY-MM-DD format.

In [21]:
employees = pd.DataFrame({'employee_name': ['Andy', 'Chris', 'Jannae', 'David'],
                          'emloyee_id': [12345, 23232, 42444, 22424],
                          'date_joined': ['2015-02-15', '2010-01-01', '2018-05-09', '2011-01-08'],
                          'age': [54, 22, 42, 39]})
employees

  employee_name  emloyee_id date_joined  age
0          Andy       12345  2015-02-15   54
1         Chris       23232  2010-01-01   22
2        Jannae       42444  2018-05-09   42
3         David       22424  2011-01-08   39

In [27]:
employees['date_joined'] = pd.to_datetime(employees['date_joined'])

In [30]:
current_date = '2021-01-25'
current_date = pd.datetime.strptime(current_date, '%Y-%m-%d')
employees['years_experience'] = ((current_date - employees.date_joined).dt.days) / 365
employees

  employee_name  emloyee_id date_joined  age  years_experience
0          Andy       12345  2015-02-15   54          5.947945
1         Chris       23232  2010-01-01   22         11.073973
2        Jannae       42444  2018-05-09   42          2.717808
3         David       22424  2011-01-08   39         10.054795

This is only one of many ways we can solve this problem.  This solution takes the number of days into account to give a float as the `years_experience`.

### 6. Customer recency

On a scale of 1-3, with 1 being least valuable and 3 being most valuable, can you classify customers based on recency of last purchase? For example, a purchase made 1 month ago is more valuable than one made 5 months ago, so the former customer would have a higher recency score than the latter.  Suppose that the current date is 01/01/2021.

In [31]:
customers = pd.DataFrame({'invoice_no': [23212, 23213, 23214, 23215, 23216],
                          'StockCode': ['85123A', '71053', '84406B', '84029E', '84092G'],
                          'InvoiceDate': ['12/1/20 8:26', '12/25/20 8:26', '12/15/20 1:11',
                                          '11/5/20 12:21', '12/30/20 6:24']})
customers

   invoice_no StockCode    InvoiceDate
0       23212    85123A   12/1/20 8:26
1       23213     71053  12/25/20 8:26
2       23214    84406B  12/15/20 1:11
3       23215    84029E  11/5/20 12:21
4       23216    84092G  12/30/20 6:24

In [38]:
customers['InvoiceDate'] = pd.to_datetime(customers['InvoiceDate'])
current_date = pd.to_datetime('01/01/2021')

In [39]:
def get_days(x):
    if x <= 10:
        return 3
    elif x > 10 and x < 30:
        return 2
    else:
        return 1

### 7. Job cost

Every night between 7 pm and midnight, two competing jobs from two different sources are randomly started, each lasting one hour.  When the jobs run simultaneously, they cause a failure in some of the other company's nightly jobs, resulting in downtime that costs \\$1000.  The CEO wants a single number representing the annual cost of this problem.  Write a function to simulate this and the estimated cost.

In [7]:
task1 = np.random.randint(0, 300, size=10000)
task2 = np.random.randint(0, 300, size=10000)

data = pd.DataFrame({'task1_start': task1,
                     'task2_start': task2})
data.head()

   task1_start  task2_start
0          100          126
1          262           85
2           87          222
3            3          129
4          239          283

In [9]:
data['overlap'] = np.where(abs(data['task1_start'] - data['task2_start']) <= 60,
                              1, 0)
data.head()

   task1_start  task2_start  overlap
0          100          126        1
1          262           85        0
2           87          222        0
3            3          129        0
4          239          283        1

In [10]:
data['overlap'].mean()

0.3625

In [11]:
# Total cost per year
0.3625 * 365 * 1000

132312.5

This problem is pretty straightforward.  We need to figure out what the probability is that two jobs will overlap.  Since the jobs are from 7-12 pm, this is 300 total minutes, and the job can begin at any random minute within the timeframe.  So we generate 10,000 random numbers between 0 and 300 and save them as `task1` and `task2` and put them in a DataFrame.  Now we need to add another column to check the overlap.  If the absolute value of the difference between `task1` and `task2` is less than or equal to 60, we assign a value of 1, representing a downtime cost.  Otherwise, we assign 0.  We then just take the mean of the `overlap` column and multiply it by 365 days in a year and \\$1000 to give us our total yearly cost of overlaps.

### 8. Chipotle orders

You are given a data set of Chipotle orders. You're asked to figure out the average order price and the average price per item ordered. Can you describe how you would do this using Python Pandas?

In [13]:
orders = pd.read_table('chipotle.tsv')
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

Before we can do any groupby analysis, we need to remove the dollar sign from the column `item_price` and then convert the column to a numeric type.  So let's go ahead and do that:

In [16]:
orders['item_price'] = orders['item_price'].str.replace('$', '')
orders['item_price'] = pd.to_numeric(orders['item_price'])
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

We need to also create a column for the total price per item:

In [21]:
orders['total_price_per_item'] = orders['item_price'] * orders['quantity']

Now we can use groupby to get the total price per order:

In [25]:
total_price_per_order = orders.groupby('order_id')[['total_price_per_item', 'quantity']].sum()
total_price_per_order.head()

          total_price_per_item  quantity
order_id
1                        11.56         4
2                        33.96         2
3                        12.67         2
4                        21.00         2
5                        13.70         2

In [28]:
average_order_price = total_price_per_order['total_price_per_item'].mean()
total_price_per_order['average_item_price'] = total_price_per_order['total_price_per_item'] / total_price_per_order['quantity']
average_price_per_item = total_price_per_order['average_item_price'].mean()
print(f'Average order price: {round(average_order_price, 2)}')
print(f'Average price per item: {round(average_price_per_item, 2)}')

Average order price: 21.39
Average price per item: 7.84